modm-ext/data.modm.io/docs/svd/header_stm32h5f4xx.svd
        <register>
          <name>FILT15CFG</name>
          <description>PLAY Filter Configuration Registers</description>
          <addressOffset>0x5c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Minimum Pulse Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IN0</name>
                  <description>Input 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN1</name>
                  <description>Input 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>Input 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN3</name>
                  <description>Input 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN4</name>
                  <description>Input 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN5</name>
                  <description>Input 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN6</name>
                  <description>Input 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN7</name>
                  <description>Input 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN8</name>
                  <description>Input 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN9</name>
                  <description>Input 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN10</name>
                  <description>Input 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN11</name>
                  <description>Input 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN12</name>
                  <description>Input 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN13</name>
                  <description>Input 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN14</name>
                  <description>Input 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN15</name>
                  <description>Input 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PREMUXSEL</name>
              <description>Input Pre-Multiplexer Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE0CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x60</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE1CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x64</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE2CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x68</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE3CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x6c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE4CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x70</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
